docs/loadtest/raw/20260227-extreme-local/ab_raw/post_message_c200.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 300 requests
Completed 600 requests
Completed 900 requests
Completed 1200 requests
Completed 1500 requests
Completed 1800 requests
Completed 2100 requests
Completed 2400 requests
Completed 2700 requests
Completed 3000 requests
Finished 3000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6688

Document Path:          /api/chats/13
Document Length:        Variable

Concurrency Level:      200
Time taken for tests:   1.268 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    3000
Total transferred:      1507795 bytes
Total body sent:        2163000
HTML transferred:       469598 bytes
Requests per second:    2366.77 [#/sec] (mean)
Time per request:       84.503 [ms] (mean)
Time per request:       0.423 [ms] (mean, across all concurrent requests)
Transfer rate:          1161.66 [Kbytes/sec] received
                        1666.45 kb/s sent
                        2828.10 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.3      0       7
Processing:     9   82   9.3     80     121
Waiting:        2   82   9.3     80     121
Total:          9   83   9.4     80     121

Percentage of the requests served within a certain time (ms)
  50%     80
  66%     82
  75%     83
  80%     86
  90%     99
  95%    102
  98%    112
  99%    117
 100%    121 (longest request)