docs/loadtest/raw/20260227-extreme-local/ab_raw/post_message_c50.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 300 requests
Completed 600 requests
Completed 900 requests
Completed 1200 requests
Completed 1500 requests
Completed 1800 requests
Completed 2100 requests
Completed 2400 requests
Completed 2700 requests
Completed 3000 requests
Finished 3000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6688

Document Path:          /api/chats/13
Document Length:        Variable

Concurrency Level:      50
Time taken for tests:   1.157 seconds
Complete requests:      3000
Failed requests:        0
Keep-Alive requests:    3000
Total transferred:      1505990 bytes
Total body sent:        2163000
HTML transferred:       467991 bytes
Requests per second:    2593.58 [#/sec] (mean)
Time per request:       19.278 [ms] (mean)
Time per request:       0.386 [ms] (mean, across all concurrent requests)
Transfer rate:          1271.45 [Kbytes/sec] received
                        1826.14 kb/s sent
                        3097.59 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     8   19   1.6     19      31
Waiting:        6   19   1.6     19      31
Total:          8   19   1.7     19      32

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     19
  75%     20
  80%     20
  90%     21
  95%     22
  98%     23
  99%     26
 100%     32 (longest request)