docs/loadtest/raw/20260227-extreme-local/ab_raw/repeat_get_chats_c300_r2.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 600 requests
Completed 1200 requests
Completed 1800 requests
Completed 2400 requests
Completed 3000 requests
Completed 3600 requests
Completed 4200 requests
Completed 4800 requests
Completed 5400 requests
Completed 6000 requests
Finished 6000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6688

Document Path:          /api/chats
Document Length:        140 bytes

Concurrency Level:      300
Time taken for tests:   0.888 seconds
Complete requests:      6000
Failed requests:        0
Keep-Alive requests:    6000
Total transferred:      2885999 bytes
HTML transferred:       840000 bytes
Requests per second:    6757.43 [#/sec] (mean)
Time per request:       44.396 [ms] (mean)
Time per request:       0.148 [ms] (mean, across all concurrent requests)
Transfer rate:          3174.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.9      0      12
Processing:    16   43   8.4     40     101
Waiting:        4   43   8.4     40     101
Total:         16   43   9.6     40     109

Percentage of the requests served within a certain time (ms)
  50%     40
  66%     41
  75%     42
  80%     46
  90%     50
  95%     61
  98%     78
  99%     93
 100%    109 (longest request)