docs/loadtest/raw/20260227-extreme-local/ab_raw/scan_get_chats_c350.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 400 requests
Completed 800 requests
Completed 1200 requests
Completed 1600 requests
Completed 2000 requests
Completed 2400 requests
Completed 2800 requests
Completed 3200 requests
Completed 3600 requests
Completed 4000 requests
Finished 4000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6688

Document Path:          /api/chats
Document Length:        140 bytes

Concurrency Level:      350
Time taken for tests:   0.608 seconds
Complete requests:      4000
Failed requests:        0
Keep-Alive requests:    4000
Total transferred:      1923999 bytes
HTML transferred:       560000 bytes
Requests per second:    6583.07 [#/sec] (mean)
Time per request:       53.167 [ms] (mean)
Time per request:       0.152 [ms] (mean, across all concurrent requests)
Transfer rate:          3092.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.5      0      12
Processing:    14   50  11.0     47      86
Waiting:        2   50  11.0     47      86
Total:         14   51  11.3     47      89

Percentage of the requests served within a certain time (ms)
  50%     47
  66%     49
  75%     51
  80%     51
  90%     70
  95%     83
  98%     84
  99%     85
 100%     89 (longest request)