docs/loadtest/raw/20260227-extreme-local/ab_raw/scan_post_message_c300.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            6688

Document Path:          /api/chats/13
Document Length:        Variable

Concurrency Level:      300
Time taken for tests:   0.749 seconds
Complete requests:      2000
Failed requests:        0
Keep-Alive requests:    2000
Total transferred:      1007036 bytes
Total body sent:        1442000
HTML transferred:       313997 bytes
Requests per second:    2668.50 [#/sec] (mean)
Time per request:       112.423 [ms] (mean)
Time per request:       0.375 [ms] (mean, across all concurrent requests)
Transfer rate:          1312.15 [Kbytes/sec] received
                        1878.89 kb/s sent
                        3191.04 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.1      0      12
Processing:    41  101  14.3    100     156
Waiting:       29  101  14.3    100     156
Total:         44  102  16.3    101     165

Percentage of the requests served within a certain time (ms)
  50%    101
  66%    102
  75%    103
  80%    104
  90%    118
  95%    143
  98%    154
  99%    158
 100%    165 (longest request)